ninety_nine_cats/app/views/cat_rental_requests/_request_form.html.erb

    <select name="cat_rental_request[cat_id]">
      <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"