ninety_nine_cats/app/controllers/cat_rental_requests_controller.rb

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    @cat_rental_request = CatRentalRequest.find(params[:id])

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 12], ["start_date", "2018-11-14"], ["end_date", "2018-11-30"], ["created_at", "2018-11-14 01:09:07.972740"], ["updated_at", "2018-11-14 01:09:07.972740"]]
---
  def create
    cat_rental_request = CatRentalRequest.new(cat_rental_request_params)

    if cat_rental_request.save