ninety_nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "didn't speak in class today\r\n  "], ["updated_at", "2018-11-13 22:42:19.334342"], ["id", 9]]
---
  def update
    cat = Cat.find(params[:id])

    if cat.update_attributes(cat_params)