ninety_nine_cats/app/models/cat_rental_request.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def overlapping_requests
    self.cat.requests.where.not('? > end_date OR ? < start_date', self.start_date, self.end_date)